.emacs.files/init.org
#+TITLE: Emacs Config
#+AUTHOR: Guillaume J. Charmes
#+TOC: true
#+DATE: [2020-05-02 Sat]

* Bootstrap
Initial steps to bootstrap the config.

** Configure package sources

Add repositories from which we'll load packages.
Setting =package-enable-at-startup= to =nil= prevents a second package load and slightly improves startup time.
Setting the TLS version is needed in emacs 26 to be able to pull from the gnu.org repo.

#+begin_src emacs-lisp :tangle yes
  (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3"
        package-archives '(
                           ("melpa" . "https://melpa.org/packages/")
                           ("celpa" . "https://celpa.conao3.com/packages/")
                           ("org"   . "https://orgmode.org/elpa/")
                           ("gnu"   . "https://elpa.gnu.org/packages/")
                           )
        )
#+end_src

** Setup use-package

If =use-package= is not installed, install it.

#+begin_src emacs-lisp :tangle yes
  (if (package-installed-p 'use-package)
    (package-refresh-contents))
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-when-compile (require 'use-package))
#+end_src

Set =ensure= by default to install packages from the remote repositories. This is equivalent to setting =:ensure t= on each call to =use-package=.
To disable, set =:ensure nil= or =:load-path=.

#+begin_src emacs-lisp :tangle yes
  (setq use-package-always-ensure t)
#+end_src

** Benchmark Init

=benchmark-init= records startup time by package so we can debug.
It only records things after it's initialised, so put as early in config as possible.

#+begin_src emacs-lisp :tangle yes
  (use-package benchmark-init :demand
    :disabled ;; TODO: Re-enable this. Broken with emacs28.
    :hook (after-init . (lambda () ; Stop the benchmark and print result after the init.
                    (benchmark-init/deactivate)
                    (message "Loaded in %s" (emacs-init-time))
                    )))
#+end_src

** Compilation options

#+begin_src emacs-lisp :tangle yes
  (setq package-native-compile t
        warning-suppress-log-types '((comp))
        warning-suppress-types '((comp))
   ;;comp-deferred-compilation t ; Enable async compilation to avoid blocking.
   )
#+end_src

** Enable Hydra

Install Hydra and enable the =:hydra= keyword for use-package.

#+begin_src emacs-lisp :tangle yes
(use-package hydra
  :config
  (use-package use-package-hydra)
  )
#+end_src


** Extend use-package

Refresh the package list if needed.

#+begin_src emacs-lisp :tangle yes
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src

Let use define an external binary as dependency with =:ensure-system-package=.

#+begin_src emacs-lisp :tangle yes
  (use-package use-package-ensure-system-package
    :custom
    (async-shell-command-buffer 'new-buffer) ; Automatically open a new buffer instead of asking about it.
    )
#+end_src

Manage the mode-line with =:delight=.

#+begin_src emacs-lisp :tangle yes
  (use-package delight)
#+end_src

* Global settings
Adjust Emacs default behavior. No packages involved.

** Default layout

Don't display the help screen on startup and disable default scratch message.

#+begin_src emacs-lisp :tangle yes
  (setq inhibit-startup-screen  t
        initial-scratch-message nil)
#+end_src

Disable GUI window decorations.

#+begin_src emacs-lisp :tangle yes
  ;; (tool-bar-mode   -1)
  ;; (scroll-bar-mode -1)
  (unless window-system (menu-bar-mode -1))
#+end_src

Disable the bell.

#+begin_src emacs-lisp :tangle yes
  (setq ring-bell-function 'ignore)
#+end_src

Show trailing whitespaces in prog mode.

#+begin_src emacs-lisp :tangle yes
  (add-hook 'prog-mode-hook #'(lambda() (setq show-trailing-whitespace t)))
#+end_src

Truncate long tines instead of wrapping and ensure the final newline.

#+begin_src emacs-lisp :tangle yes
  (setq-default truncate-lines        t
                require-final-newline t)
#+end_src

Define sane indentation.

#+begin_src emacs-lisp :tangle yes
  ;; (setq-default indent-tabs-mode nil
  ;;             tab-width        8)
#+end_src

Enable syntax highlight and highlight parens.

#+begin_src emacs-lisp :tangle yes
  ;; (setq font-lock-maximum-decoration t)
  ;; (global-font-lock-mode t)
  (show-paren-mode t)
#+end_src

Show line/column in the mode-line.

#+begin_src emacs-lisp :tangle yes
  (column-number-mode t)
  (line-number-mode t)
#+end_src

Create a region when creating a mark.

#+begin_src emacs-lisp :tangle yes
  ;; (transient-mark-mode t)
#+end_src

Enable the mouse support in the terminal.

#+begin_src emacs-lisp :tangle yes
  (use-package emacs
    :unless window-system
    :config
    (xterm-mouse-mode t)
    :custom
    (mouse-wheel-scroll-amount '(5 ((shift) . hscroll) ((meta)) ((control) . vscroll)))
    ;; :bind
    ;; ("<mouse-4>" . (lambda() (interactive) (scroll-down 5)))
    ;; ("<mouse-5>" . (lambda() (interactive) (scroll-up 5)))
    )
#+end_src

Keep track of the window layouts.

#+begin_src emacs-lisp :tangle yes
  (winner-mode t)
#+end_src

Enable eldoc but hide it from the mode-lint (:delight).

#+begin_src emacs-lisp :tangle yes
  (use-package eldoc :delight
    :config
   (global-eldoc-mode 1)
    )
#+end_src

Set sane defaults for the kill ring.

#+begin_src emacs-lisp :tangle yes
  (setq kill-ring-max 200
        kill-do-not-save-duplicates t
        save-interprogram-paste-before-kill t)
#+end_src

*** Bindings                                                     :bindings:

Use =super= for copy/paste and undo to make for a better integration with windows/OSX.

#+begin_src emacs-lisp :tangle yes
  (bind-key "s-x" 'kill-region)
  (bind-key "s-c" 'kill-ring-save)
  (bind-key "s-v" 'yank)
  (bind-key "s-z" 'undo)
#+end_src

Set globally comment/uncomment.

#+begin_src emacs-lisp :tangle yes
  ;; (bind-key "C-c C-c" 'comment-region)
  ;; (bind-key "C-c C-u" 'uncomment-region)
#+end_src

Quickly toggle the line numbers in the margin.

#+begin_src emacs-lisp :tangle yes
  (bind-key "C-c C-l" 'display-line-numbers-mode)
#+end_src


** Backup / History

Store all backup and temporary files in =~/.emacs.d/.tmp= instead of polluting the current directory.

Define the target directories and create them if they don't exist.

#+begin_src emacs-lisp :tangle yes
  (setq backup-dir     "~/.emacs.tmp/backup"
        auto-saves-dir "~/.emacs.tmp/auto-saves/")
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
#+end_src

Tell emacs to use those directories instead of the local one.

#+begin_src emacs-lisp :tangle yes
  (setq backup-directory-alist         `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
        auto-save-list-file-prefix     (concat auto-saves-dir ".saves-")
        tramp-backup-directory-alist   `((".*" . ,backup-dir))
        tramp-auto-save-directory      auto-saves-dir)
#+end_src

Define how to hanlde automatic bakcups / open files.

#+begin_src emacs-lisp :tangle yes
  (setq create-lockfiles nil           ; Don't create lockfiles when editing a file.
        backup-by-copying t            ; Don't delink hardlinks.
        delete-old-versions t          ; Clean up the backups.
        version-control t              ; Use version numbers on backups.
        kept-new-versions 5            ; Keep some new versions
        kept-old-versions 2)           ; and some old ones, too.
#+end_src

Keep track of recent files.

#+begin_src emacs-lisp :tangle yes
  (setq recentf-exclude '(
                          ".*/.emacs.d/.*"
                          ".*/go/pkg/mod/.*"
                          ".*/.emacs.tmp/.*"
                          ".*/node_modules/.*"
                          ".*/vendor/.*"
                          ".*\\.el.gz$"
                          )
        recentf-save-file "~/.emacs.tmp/recentf")
  (recentf-mode t)
#+end_src

** Disable customize settings outside config file

Create a file in =~/.emacs.d= with the customization done outside the config file instead of overwriting =~/.emacs=.

#+begin_src emacs-lisp :tangle yes
  (setq custom-file "~/.emacs.d/custom.el")
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src

** Prompts shortcuts

Allow to use y/n instead of "yes"/"no".

#+begin_src emacs-lisp :tangle yes
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

Skip the prompt when opening symlinks.

#+begin_src emacs-lisp :tangle yes
  (setq vc-follow-symlinks t)
#+end_src

* Editing
Setup the general edit config.

** EditorConfig

Use editor config to handle basic settings like encoding, line lengths, etc.
See [[file:../.editorconfig][global editorconfig]] for more details.

#+begin_src emacs-lisp :tangle yes
  (use-package editorconfig :delight
    :init (setq editorconfig--enable-20210221-testing t) ; Enable the testing branch to work around a bug causing too many reloads. Need to be in :init as it must be set before the package loads.
    :config (editorconfig-mode t))
#+end_src

** Undo tree

=undo-tree= visualises undo history as a tree for easy navigation.

Enable undo history and store it in =~/.emacs.d.tmp/undo-tree=.

#+begin_src emacs-lisp :tangle yes
  (use-package undo-tree :delight
    :after hydra
    :demand
    :custom
    (undo-tree-auto-save-history t)
    (undo-tree-history-directory-alist '((".*" . "~/.emacs.tmp/undo-tree")))
    (undo-tree-visualizer-timestamps t)
    :config
    (global-undo-tree-mode)
    :bind (:map undo-tree-map ("C-_" . hydra-undo-tree/undo-tree-undo))
    :hydra (hydra-undo-tree (:idle 2)
            "
  _p_: undo  _n_: redo _s_: save _l_: load   "
            ("p"   undo-tree-undo)
            ("n"   undo-tree-redo)
            ("s"   undo-tree-save-history)
            ("l"   undo-tree-load-history)
            ("u"   undo-tree-visualize "visualize" :color blue)
            ("q"   nil "quit" :color blue))
    )
#+end_src

** Which Key
Show the available next key bindings.

#+begin_src emacs-lisp :tangle yes
  (use-package which-key :delight
    :config (which-key-mode t)
    )
#+end_src

