.emacs.files/init.el
(setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3"
      package-archives '(
                         ("melpa" . "https://melpa.org/packages/")
                         ("celpa" . "https://celpa.conao3.com/packages/")
                         ("org"   . "https://orgmode.org/elpa/")
                         ("gnu"   . "https://elpa.gnu.org/packages/")
                         )
      )

(if (package-installed-p 'use-package)
  (package-refresh-contents))
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile (require 'use-package))

(setq use-package-always-ensure t)

(use-package benchmark-init :demand
  :disabled ;; TODO: Re-enable this. Broken with emacs28.
  :hook (after-init . (lambda () ; Stop the benchmark and print result after the init.
                  (benchmark-init/deactivate)
                  (message "Loaded in %s" (emacs-init-time))
                  )))

(setq package-native-compile t
      warning-suppress-log-types '((comp))
      warning-suppress-types '((comp))
 ;;comp-deferred-compilation t ; Enable async compilation to avoid blocking.
 )

(use-package hydra
  :config
  (use-package use-package-hydra)
  )

(unless package-archive-contents
  (package-refresh-contents))

(use-package use-package-ensure-system-package
  :custom
  (async-shell-command-buffer 'new-buffer) ; Automatically open a new buffer instead of asking about it.
  )

(use-package delight)

(setq inhibit-startup-screen  t
      initial-scratch-message nil)

;; (tool-bar-mode   -1)
;; (scroll-bar-mode -1)
(unless window-system (menu-bar-mode -1))

(setq ring-bell-function 'ignore)

(add-hook 'prog-mode-hook #'(lambda() (setq show-trailing-whitespace t)))

(setq-default truncate-lines        t
              require-final-newline t)

;; (setq-default indent-tabs-mode nil
;;             tab-width        8)

;; (setq font-lock-maximum-decoration t)
;; (global-font-lock-mode t)
(show-paren-mode t)

(column-number-mode t)
(line-number-mode t)

;; (transient-mark-mode t)

(use-package emacs
  :unless window-system
  :config
  (xterm-mouse-mode t)
  :custom
  (mouse-wheel-scroll-amount '(5 ((shift) . hscroll) ((meta)) ((control) . vscroll)))
  ;; :bind
  ;; ("<mouse-4>" . (lambda() (interactive) (scroll-down 5)))
  ;; ("<mouse-5>" . (lambda() (interactive) (scroll-up 5)))
  )

(winner-mode t)

(use-package eldoc :delight
  :config
 (global-eldoc-mode 1)
  )

(setq kill-ring-max 200
      kill-do-not-save-duplicates t
      save-interprogram-paste-before-kill t)

(bind-key "s-x" 'kill-region)
(bind-key "s-c" 'kill-ring-save)
(bind-key "s-v" 'yank)
(bind-key "s-z" 'undo)

;; (bind-key "C-c C-c" 'comment-region)
;; (bind-key "C-c C-u" 'uncomment-region)

(bind-key "C-c C-l" 'display-line-numbers-mode)

(setq backup-dir     "~/.emacs.tmp/backup"
      auto-saves-dir "~/.emacs.tmp/auto-saves/")
(dolist (dir (list backup-dir auto-saves-dir))
  (when (not (file-directory-p dir))
    (make-directory dir t)))

(setq backup-directory-alist         `(("." . ,backup-dir))
      auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
      auto-save-list-file-prefix     (concat auto-saves-dir ".saves-")
      tramp-backup-directory-alist   `((".*" . ,backup-dir))
      tramp-auto-save-directory      auto-saves-dir)

(setq create-lockfiles nil           ; Don't create lockfiles when editing a file.
      backup-by-copying t            ; Don't delink hardlinks.
      delete-old-versions t          ; Clean up the backups.
      version-control t              ; Use version numbers on backups.
      kept-new-versions 5            ; Keep some new versions
      kept-old-versions 2)           ; and some old ones, too.

(setq recentf-exclude '(
                        ".*/.emacs.d/.*"
                        ".*/go/pkg/mod/.*"
                        ".*/.emacs.tmp/.*"
                        ".*/node_modules/.*"
                        ".*/vendor/.*"
                        ".*\\.el.gz$"
                        )
      recentf-save-file "~/.emacs.tmp/recentf")
(recentf-mode t)

(setq custom-file "~/.emacs.d/custom.el")
(when (file-exists-p custom-file)
  (load custom-file))

(fset 'yes-or-no-p 'y-or-n-p)

(setq vc-follow-symlinks t)

(use-package editorconfig :delight
  :init (setq editorconfig--enable-20210221-testing t) ; Enable the testing branch to work around a bug causing too many reloads. Need to be in :init as it must be set before the package loads.
  :config (editorconfig-mode t))

(use-package undo-tree :delight
  :after hydra
  :demand
  :custom
  (undo-tree-auto-save-history t)
  (undo-tree-history-directory-alist '((".*" . "~/.emacs.tmp/undo-tree")))
  (undo-tree-visualizer-timestamps t)
  :config
  (global-undo-tree-mode)
  :bind (:map undo-tree-map ("C-_" . hydra-undo-tree/undo-tree-undo))
  :hydra (hydra-undo-tree (:idle 2)
          "
_p_: undo  _n_: redo _s_: save _l_: load   "
          ("p"   undo-tree-undo)
          ("n"   undo-tree-redo)
          ("s"   undo-tree-save-history)
          ("l"   undo-tree-load-history)
          ("u"   undo-tree-visualize "visualize" :color blue)
          ("q"   nil "quit" :color blue))
  )

(use-package which-key :delight
  :config (which-key-mode t)
  )
