.emacs.files/init.org
** Spellcheck

#+begin_src emacs-lisp :tangle yes
  (use-package flyspell :delight
    :ensure-system-package aspell
    :hook
    ((web-mode org-mode yaml-mode markdown-mode git-commit-mode) . flyspell-mode)
    (prog-mode . flyspell-prog-mode)
    ;(before-save . flyspell-buffer)
    :custom
    (flyspell-issue-message-flag nil)
    (ispell-program-name "aspell")
    (ispell-extra-args '("--sug-mode=ultra" "--lang=en_US" "--run-together"))
    :config (use-package flyspell-correct-ivy
      ;:disabled
      :bind ("C-M-:" . flyspell-correct-at-point)
      :config (setq flyspell-correct-interface #'flyspell-correct-ivy)))
#+end_src

* Autocomplete
** LSP

#+begin_src emacs-lisp :tangle yes
  ;(use-package helm-flex)
  (use-package lsp-mode :delight " LSP"
    :hook
    (lsp-after-open . lsp-origami-try-enable)
    (lsp-mode       . lsp-enable-which-key-integration)
    :custom
    (lsp-file-watch-ignored '(
                              "[/\\\\].git$"
                              "[/\\\\]infrastructure$"
                              "[/\\\\]vendor$"
                              "[/\\\\]cli$"
                              "[/\\\\]internal$"
                              "[/\\\\]functions[/\\\\]migrations$"
                              "[/\\\\]tests[/\\\\]mocks$"
                              "[/\\\\]\\.cache$"
                              "[/\\\\]\\.gocache$"
                              "[/\\\\]_archives$"
                              "[/\\\\]node_modules$"
                              ".*node_modules.*"
                              ))
    (lsp-enable-links nil)
    (lsp-keymap-prefix "C-c l") ; Set the keymap prefix. (Default to s-l.)

    (lsp-prefer-flymake nil)       ; Disable flymake in favor of flycheck.
    ;; (lsp-diagnostic-package :none) ; Disable lsp flycheck in favor of regular flycheck.
    (lsp-diagnostics-flycheck-default-level 'info)
    (lsp-diagnostic-clean-after-change t)
    (gc-cons-threshold (* 100 1024 1024)) ; Increase emacs' garbage collector limit to 100M. LSP is demanding.
    (read-process-output-max (* 3 1024 1024)) ; Increase the emacs' subprocesses max output to 3MB.
    ;; (lsp-eldoc-enable-hover nil) ;; Disable eldoc. Redundant with lsp-ui-doc.

    (lsp-auto-guess-root t)        ; Auto detect project root, based on projectile.
    (lsp-keep-workspace-alive t)
    (lsp-enable-imenu nil)
    ;; (lsp-lens-enable t)
    (lsp-signature-auto-activate nil)                    ; Don't auto pop the signatures as we have it already in eldoc and lsp-ui.
    ;; (lsp-completion-enable nil)                       ; Disable completion from LSP in favor of tide.
    (lsp-display-inline-image nil)                       ; Make sure we don't try to display graphics in the terminal.
    ;; (lsp-document-sync-method 'lsp--sync-incremental) ; Set the sync mode to incremental to (try to) improve performance.
    (lsp-document-sync-method 'lsp--sync-full)           ; Set the sync mode to full to (try to) avoid LSP getting lost all the time.
    :bind
    (:map lsp-mode-map
          ("C-c e"   . lsp-rename)
          )
    :config
    (lsp-enable-which-key-integration)
    :config
    (use-package lsp-ui ;; Overlay UI components for LSP.
      :custom
      (lsp-ui-doc-position       'top)
      ;; (lsp-ui-doc-header         t)
      (lsp-ui-doc-use-childframe nil)
      ;; (lsp-ui-doc-enable         t)
      (lsp-ui-sideline-ignore-duplicate t)
      (lsp-ui-sideline-show-code-actions t)
      (lsp-ui-sideline-show-symbol t)
      (lsp-ui-sideline-show-hover t)
      (lsp-ui-doc-enable nil) ; lsp-ui-doc breaks the mouse resize.
      (lsp-ui-imenu-enable nil)

      ;; (lsp-ui-doc-include-signature t)
      ;; (lsp-ui-peek-fontify 'always)

      ;; For referemce:
      ;; (use-package lsp-ui
      ;;   :config
      ;;   (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
      ;;   (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
      ;;   (setq lsp-ui-sideline-enable nil
      ;;         lsp-ui-sideline-update-mode 'line
      ;;         lsp-ui-sideline-show-code-actions t
      ;;         lsp-ui-sideline-show-hover t
      ;;         lsp-ui-doc-enable nil
      ;;         lsp-ui-doc-include-signature t
      ;;         lsp-eldoc-enable-hover nil ; Disable eldoc displays in minibuffer
      ;;         lsp-ui-doc-position 'at-point
      ;;         lsp-ui-imenu-enable t
      ;;         lsp-ui-sideline-ignore-duplicate t))

      :bind
      (:map lsp-ui-flycheck-list-mode-map ;; Fix the terminal mode bindings.
            ("RET"   . lsp-ui-flycheck-list--view)
            ("TAB"   . lsp-ui-flycheck-list--visit)
            ("C-c l" . lsp-ui-flycheck-list--quit)
            )
      (:map lsp-ui-mode-map
            ;; ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
            ([remap xref-find-references]  . lsp-ui-peek-find-references)
            )
      )
    )
#+end_src

** Company

#+begin_src emacs-lisp :tangle yes
  (use-package company :defer :delight
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-common-or-cycle)
          ("TAB"   . company-complete-common-or-cycle)
          ("C-n"   . company-select-next)
          ("C-p"   . company-select-previous))
    (:map company-search-map
          ("C-p" . company-select-previous)
          ("C-n" . company-select-next))

    :custom
                                          ;(company-echo-delay 0)
    (company-idle-delay 0.2)
    (company-minimum-prefix-length 2)     ;; Show company after the first char typed.
    (company-tooltip-align-annotations t) ;; Align the completion popu.
    (company-show-numbers t)              ;; Easy navigation to candidates with M-<n>.
    (company-dabbrev-downcase nil)        ;; Don't worry about case.
    :hook
    (after-init . global-company-mode)

    :bind
    (:map company-mode-map
          ("TAB" . company-indent-or-complete-common))


    ;;:custom
    ;;(company-backends '()) ;; Clear the default backends.
    :config
    (use-package company-quickhelp
      :disabled
      :defines company-quickhelp-delay
      :bind (:map company-active-map
                  ("M-h" . company-quickhelp-manual-begin))
      :hook (global-company-mode . company-quickhelp-mode)
      :custom (company-quickhelp-delay 0.3)
      :config
      (use-package company-quickhelp-terminal
        :disabled
        ;:config
        ;(company-quickhelp-terminal-mode 1)
        )
      )

    ;; LSP completion.
    (use-package company-lsp
      :disabled
      :load-path "~/.emacs.files/libs"
      :preface
      ;; Work around from ht tps://github.com/tigersoldier/company-lsp/issues/145
      (defun lsp--sort-completions (completions)
        (lsp-completion--sort-completions completions))
      (defun lsp--annotate (item)
        (lsp-completion--annotate item))
      (defun lsp--resolve-completion (item)
        (lsp-completion--resolve item))
      :config
      (push 'company-lsp company-backends)
      :custom
      (company-lsp-cache-candidates t)
      (company-lsp-async t)
      (company-lsp-enable-snippet t)
      (company-lsp-enable-recompletion t)
      )
    )
#+end_src

* Navigation
** Projectile

Use Projectile for workspace management.

#+begin_src emacs-lisp :tangle yes
  (use-package projectile
    :config (projectile-mode +1)
    :delight '(:eval (concat " <" (projectile-project-name) ">"))
    :custom
    (projectile-completion-system 'ivy)
    (projectile-enable-caching t)
    :bind-keymap
    ("C-c p" . projectile-command-map)
  )
#+end_src

