.emacs.files/init.org
** Ivy

=Ivy= is a generic completion framework which uses the minibuffer.
Turning on =ivy-mode= enables replacement of lots of built in =ido= functionality.

Add recent files and window layouts to the switch buffer list.

#+begin_src emacs-lisp :tangle yes
  (setq ivy-use-virtual-buffers t)
#+end_src

Hide . and .. in file list.

#+begin_src emacs-lisp :tangle yes
  (setq ivy-extra-directories nil)
#+end_src

Keep swiper centered.

#+begin_src emacs-lisp :tangle yes
  (setq swiper-action-recenter t)
#+end_src

Install =Ivy= and friends.

#+begin_src emacs-lisp :tangle yes
  (use-package ivy :delight
    ;:disabled
    :config (ivy-mode t))
#+end_src

=counsel= is a collection of =ivy= enhanced versions of common Emacs commands.

#+begin_src emacs-lisp :tangle yes
  (use-package counsel :delight :after ivy
    ;:disabled
    :config (counsel-mode t))
#+end_src

=ivy-rich= extends ivy and provides an interface with more details.

#+begin_src emacs-lisp :tangle yes
  (use-package ivy-rich :after ivy counsel
    ;:disabled
    :custom
    (ivy-rich-path-style    'abbrev)
    (ivy-virtual-abbreviate 'full)
    :config (ivy-rich-mode t))
#+end_src

=prescient= sorts and filters candidate lists for ivy/counsel.

#+begin_src emacs-lisp :tangle yes
  (use-package prescient :after ivy
    ;; :disabled
    :config (prescient-persist-mode t))
  (use-package ivy-prescient :after prescient
    ;; :disabled
    :config (ivy-prescient-mode t))
#+end_src

=swiper= is an =ivy= enhanced version of isearch.

#+begin_src emacs-lisp :tangle yes
  (use-package swiper
    ;; :disabled
    )
#+end_src

*** Bindings                                                       :bindings:

#+begin_src emacs-lisp :tangle yes
  (bind-keys
    ("C-c v p" . ivy-push-view)
    ("C-c v o" . ivy-pop-view)
    ("C-c v ." . ivy-switch-view)
    ("C-s"     . counsel-grep-or-swiper))
  (bind-keys :map ivy-minibuffer-map
      ("C-j" . ivy-immediate-done)
      ("RET" . ivy-alt-done))

#+end_src

** Multiple Cursor

Enable multiple cursors support.

#+begin_src emacs-lisp :tangle yes
  (use-package multiple-cursors
    :after hydra
    :bind
    ("C-c h c"     . hydra-multiple-cursors/body)
    ("M-n"         . mc/mark-next-like-this)         ;; Add new cursor with matching region.
    ("M-p"         . mc/mark-previous-like-this)     ;; Add new cursor with matching region.
    ("M-]"         . mc/mark-all-like-this)          ;; Add new cursor with matching region.
    ("C-c SPC"     . set-rectangular-region-anchor)  ;; Rectangular region with many cursors.
    ("M-SPC"       . set-rectangular-region-anchor)  ;; Rectangular region with many cursors.
    (:map mc/keymap ("C-y" . yank))
    :hydra (hydra-multiple-cursors (:hint nil)
                                   "
   Up^^             Down^^           Miscellaneous           % 2(mc/num-cursors) cursor%s(if (> (mc/num-cursors) 1) \"s\" \"\")
  ------------------------------------------------------------------
   [_p_]   Next     [_n_]   Next     [_l_] Edit lines  [_0_] Insert numbers
   [_P_]   Skip     [_N_]   Skip     [_a_] Mark all    [_A_] Insert letters
   [_M-p_] Unmark   [_M-n_] Unmark   [_s_] Search      [_q_] Quit
   [_|_] Align with input CHAR       [Click] Cursor at point"
                                   ("l" mc/edit-lines :exit t)
                                   ("a" mc/mark-all-like-this :exit t)
                                   ("n" mc/mark-next-like-this)
                                   ("N" mc/skip-to-next-like-this)
                                   ("M-n" mc/unmark-next-like-this)
                                   ("p" mc/mark-previous-like-this)
                                   ("P" mc/skip-to-previous-like-this)
                                   ("M-p" mc/unmark-previous-like-this)
                                   ("|" mc/vertical-align)
                                   ("s" mc/mark-all-in-region-regexp :exit t)
                                   ("0" mc/insert-numbers :exit t)
                                   ("A" mc/insert-letters :exit t)
                                   ("<mouse-1>" mc/add-cursor-on-click)
                                   ;; Help with click recognition in this hydra
                                   ("<down-mouse-1>" ignore)
                                   ("<drag-mouse-1>" ignore)
                                   ("q" nil))
    )
#+end_src

* Appearance
** Theme

Install and enable the theme.

#+begin_src emacs-lisp :tangle yes
  (use-package nord-theme
    ;; :config (load-theme 'nord t)
    )
#+end_src

#+begin_src emacs-lisp :tangle yes
  (use-package monokai-theme
    ;; :config (load-theme 'monokai t)
    )
#+end_src

#+begin_src emacs-lisp :tangle yes
  (use-package gruvbox-theme
    :config (load-theme 'gruvbox t)
    )
#+end_src

#+begin_src emacs-lisp :tangle no
  (use-package monokai-pro-theme
    ;; :config (load-theme 'monokai-pro t)
    )
#+end_src

In terminal mode, use a full size vertical bar for splits.

#+begin_src emacs-lisp :tangle yes
  (unless window-system
    (set-display-table-slot standard-display-table 'vertical-border (make-glyph-code ?│)))
#+end_src

** Font

Using fira code for ligatures.

Install the font on debian/ubuntu.

#+begin_src sh :tangle no
  sudo apt-get install fonts-firacode
#+end_src

Install the font on osx.

#+begin_src sh :tangle no
  brew tap homebrew/cask-fonts
  brew cask install font-fira-code
#+end_src

Enable the font in emacs.

#+begin_src emacs-lisp :tangle yes
  (use-package emacs
    :when window-system
    :config
    (set-frame-font "Fira Code 12" nil t)
  )
#+end_src

Use a different font for the mode line.

#+begin_src emacs-lisp :tangle yes
  (use-package emacs
    :when window-system
    :config
    (set-face-attribute 'mode-line nil :font "DejaVu Sans Mono-8")
  )
#+end_src

Enable ligatures in GUI mode.

#+begin_src emacs-lisp :tangle yes
  (use-package fira-code-mode
    :when window-system
    :custom
    (fira-code-mode-disabled-ligatures '(":" "[]" "#{" "#(" "#_" "#_(" "x")) ; List of ligatures to turn off
    :hook (prog-mode . fira-code-mode)
    )
#+end_src

** Mode Line

=feebleline= is a minimalist mode line replacement.

#+begin_src emacs-lisp :tangle no
  (use-package feebleline
    :config (feebleline-mode 't))
#+end_src

* TODO Coding
** Compilation

Don't ask about killing current process before restarting and enable scrolling in the output buffer.

#+begin_src emacs-lisp :tangle yes
  (setq compilation-always-kill   t
        compilation-scroll-output t)
#+end_src

Use proper ansi colors in the output buffer.

#+begin_src emacs-lisp :tangle yes
  ;; (setq compilation-environment '("TERM=xterm-truecolor" "COLORTERM=truecolor"))
  (setq compilation-environment '("TERM=dumb"))
#+end_src

Use the =xterm-color= package to replace the native ansi.el to have better support for colors.

#+begin_src emacs-lisp :tangle yes
  ;(use-package xterm-color
  ;  :preface
  ;  (defun my/compilation-color (proc)
  ;    (lv-message "Starting new compilation!")
  ;    ;; We need to differentiate between compilation-mode buffers
  ;    ;; and running as part of comint.
  ;    (when (eq (process-filter proc) 'compilation-filter)
  ;      ;; This is a process associated with a compilation-mode buffer.
  ;      ;; We may call `xterm-color-filter' before its own filter function.
  ;      (set-process-filter proc (lambda (proc string)
  ;                                 (funcall #'compilation-filter proc
  ;                                          (xterm-color-filter string))))))
  ;  ;:hook (compilation-start . my/compilation-color)
  ;  )
#+end_src

*** Bindings                                                     :bindings:

Create bindings to quickly recompile and kill the running command.

#+begin_src emacs-lisp :tangle yes
  (use-package emacs
    :disabled ;; Try without for a while see if still needed.
    :bind
    ("C-c r"  . (lambda() (interactive) (save-some-buffers t) (recompile)))
    ("C-c k" . kill-compilation)
    )
#+end_src

** Programming specific interface improvements

Use =smartparens= to help keeping parentheses balanced.

#+begin_src emacs-lisp :tangle yes
  (use-package smartparens :delight
    :disabled
    :hook (prog-mode . smartparens-mode)
    )
#+end_src

Highlight parens etc. for improved readability.

#+begin_src emacs-lisp :tangle yes
  (use-package rainbow-delimiters :delight
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

Highlight strings which represent colours. I only want this in programming modes, and I don't want colour names to be highlighted (=x-colors=).

#+begin_src emacs-lisp :tangle yes
  (use-package rainbow-mode :delight
    :custom (rainbow-x-colors nil)
    :hook (prog-mode . rainbow-mode))
#+end_src

Expand parentheses for me.

#+begin_src emacs-lisp :tangle no
  (add-hook 'prog-mode-hook 'electric-pair-mode)
#+end_src

** Git

=git-timemachine= steps through historic versions of git controlled file.

#+begin_src emacs-lisp :tangle yes
  (use-package git-timemachine
    :bind ("M-g t" . git-timemachine-toggle))
#+end_src


=Magit= is an interface to git. Summon it with =C-x g=.

#+begin_src emacs-lisp :tangle yes
  (use-package magit
    :bind ("M-g s" . magit-status))
#+end_src

Display line changes in gutter based on git history. Enable it everywhere.

#+begin_src emacs-lisp :tangle yes
  ;(use-package git-gutter-fringe
  ;  :config (global-git-gutter-mode t))
#+end_src

