.emacs.files/init.el

(setq ivy-use-virtual-buffers t)

(setq ivy-extra-directories nil)

(setq swiper-action-recenter t)

(use-package ivy :delight
  ;:disabled
  :config (ivy-mode t))

(use-package counsel :delight :after ivy
  ;:disabled
  :config (counsel-mode t))

(use-package ivy-rich :after ivy counsel
  ;:disabled
  :custom
  (ivy-rich-path-style    'abbrev)
  (ivy-virtual-abbreviate 'full)
  :config (ivy-rich-mode t))

(use-package prescient :after ivy
  ;; :disabled
  :config (prescient-persist-mode t))
(use-package ivy-prescient :after prescient
  ;; :disabled
  :config (ivy-prescient-mode t))

(use-package swiper
  ;; :disabled
  )

(bind-keys
  ("C-c v p" . ivy-push-view)
  ("C-c v o" . ivy-pop-view)
  ("C-c v ." . ivy-switch-view)
  ("C-s"     . counsel-grep-or-swiper))
(bind-keys :map ivy-minibuffer-map
    ("C-j" . ivy-immediate-done)
    ("RET" . ivy-alt-done))

(use-package multiple-cursors
  :after hydra
  :bind
  ("C-c h c"     . hydra-multiple-cursors/body)
  ("M-n"         . mc/mark-next-like-this)         ;; Add new cursor with matching region.
  ("M-p"         . mc/mark-previous-like-this)     ;; Add new cursor with matching region.
  ("M-]"         . mc/mark-all-like-this)          ;; Add new cursor with matching region.
  ("C-c SPC"     . set-rectangular-region-anchor)  ;; Rectangular region with many cursors.
  ("M-SPC"       . set-rectangular-region-anchor)  ;; Rectangular region with many cursors.
  (:map mc/keymap ("C-y" . yank))
  :hydra (hydra-multiple-cursors (:hint nil)
                                 "
 Up^^             Down^^           Miscellaneous           % 2(mc/num-cursors) cursor%s(if (> (mc/num-cursors) 1) \"s\" \"\")
------------------------------------------------------------------
 [_p_]   Next     [_n_]   Next     [_l_] Edit lines  [_0_] Insert numbers
 [_P_]   Skip     [_N_]   Skip     [_a_] Mark all    [_A_] Insert letters
 [_M-p_] Unmark   [_M-n_] Unmark   [_s_] Search      [_q_] Quit
 [_|_] Align with input CHAR       [Click] Cursor at point"
                                 ("l" mc/edit-lines :exit t)
                                 ("a" mc/mark-all-like-this :exit t)
                                 ("n" mc/mark-next-like-this)
                                 ("N" mc/skip-to-next-like-this)
                                 ("M-n" mc/unmark-next-like-this)
                                 ("p" mc/mark-previous-like-this)
                                 ("P" mc/skip-to-previous-like-this)
                                 ("M-p" mc/unmark-previous-like-this)
                                 ("|" mc/vertical-align)
                                 ("s" mc/mark-all-in-region-regexp :exit t)
                                 ("0" mc/insert-numbers :exit t)
                                 ("A" mc/insert-letters :exit t)
                                 ("<mouse-1>" mc/add-cursor-on-click)
                                 ;; Help with click recognition in this hydra
                                 ("<down-mouse-1>" ignore)
                                 ("<drag-mouse-1>" ignore)
                                 ("q" nil))
  )

(use-package nord-theme
  ;; :config (load-theme 'nord t)
  )

(use-package monokai-theme
  ;; :config (load-theme 'monokai t)
  )

(use-package gruvbox-theme
  :config (load-theme 'monokai t)
  )

(unless window-system
  (set-display-table-slot standard-display-table 'vertical-border (make-glyph-code ?│)))

(use-package emacs
  :when window-system
  :config
  (set-frame-font "Fira Code 12" nil t)
)

(use-package emacs
  :when window-system
  :config
  (set-face-attribute 'mode-line nil :font "DejaVu Sans Mono-8")
)

(use-package fira-code-mode
  :when window-system
  :custom
  (fira-code-mode-disabled-ligatures '(":" "[]" "#{" "#(" "#_" "#_(" "x")) ; List of ligatures to turn off
  :hook (prog-mode . fira-code-mode)
  )

(setq compilation-always-kill   t
      compilation-scroll-output t)

;; (setq compilation-environment '("TERM=xterm-truecolor" "COLORTERM=truecolor"))
(setq compilation-environment '("TERM=dumb"))

;(use-package xterm-color
;  :preface
;  (defun my/compilation-color (proc)
;    (lv-message "Starting new compilation!")
;    ;; We need to differentiate between compilation-mode buffers
;    ;; and running as part of comint.
;    (when (eq (process-filter proc) 'compilation-filter)
;      ;; This is a process associated with a compilation-mode buffer.
;      ;; We may call `xterm-color-filter' before its own filter function.
;      (set-process-filter proc (lambda (proc string)
;                                 (funcall #'compilation-filter proc
;                                          (xterm-color-filter string))))))
;  ;:hook (compilation-start . my/compilation-color)
;  )

(use-package emacs
  :disabled ;; Try without for a while see if still needed.
  :bind
  ("C-c r"  . (lambda() (interactive) (save-some-buffers t) (recompile)))
  ("C-c k" . kill-compilation)
  )

(use-package smartparens :delight
  :disabled
  :hook (prog-mode . smartparens-mode)
  )

(use-package rainbow-delimiters :delight
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rainbow-mode :delight
  :custom (rainbow-x-colors nil)
  :hook (prog-mode . rainbow-mode))

(use-package git-timemachine
  :bind ("M-g t" . git-timemachine-toggle))

(use-package magit
  :bind ("M-g s" . magit-status))

;(use-package git-gutter-fringe
;  :config (global-git-gutter-mode t))
