.emacs.files/init.org
** TODO Syntax checking

TODO: Cleanup shellcheck and document the related packages.

=Flycheck= is a general linter framework which other packages hook into. It's an improvment on the built in =flymake=.

#+begin_src emacs-lisp :tangle yes
  (use-package flycheck
    :after nvm ; flycheck needs various binaries from npm to setup js/ts linters.
    :ensure-system-package shellcheck
    :custom
    (flycheck-check-syntax-automatically '(save mode-enabled))
    ;; NOTE: Disabled in favor of flycheck-tip.
    ;; :bind
    ;; ("C-c <up>"   . flycheck-next-error)     ; Ctrl-c up   to go to next error.
    ;; ("C-c <down>" . flycheck-previous-error) ; Ctrl-c down to go to previous error.
    :init
    ;; From https://www.flycheck.org/en/28/_downloads/flycheck.html (search for "shellcheck").
    (flycheck-define-checker sh-shellcheck ; Create a custom checker for shellcheck.
      "A shell script syntax and style checker using Shellcheck."
      :command ("shellcheck" "-f" "checkstyle" "-s" (eval (symbol-name sh-shell)) source)
      :modes sh-mode
      :error-parser flycheck-parse-checkstyle)
    :hook
    (sh-mode . flycheck-mode)                                   ; Enable flycheck in sh-mode.
    )
#+end_src


#+begin_src emacs-lisp :tangle yes
  (use-package flycheck-tip
    :after (flycheck hydra)
    :bind
    (:map flycheck-mode-map
          ("C-c <up>"   . hydra-flycheck/flycheck-tip-cycle)         ; Ctrl-c up   to go to next error.
          ("C-c <down>" . hydra-flycheck/flycheck-tip-cycle-reverse) ; Ctrl-c down to go to previous error.
          ("C-c C-n"    . flycheck-tip-cycle)
          ("C-c C-p"    . flycheck-tip-cycle-reverse)
          )
    ("C-c h f" . hydra-flycheck/body)
    :hydra (hydra-flycheck
            (:pre (flycheck-list-errors)
                  :post (quit-windows-on "*Flycheck errors*")
                  :hint nil)
            "Errors"
            ("f" flycheck-error-list-set-filter "Filter")
            ("j" flycheck-tip-cycle "Next")
            ("k" flycheck-tip-cycle-reverse "Previous")
            ("gg" flycheck-first-error "First")
            ("G" (progn (goto-char (point-max)) (flycheck-previous-error)) "Last")
            ("q" nil))
    )
#+end_src

#+begin_src emacs-lisp :tangle yes
  (use-package flycheck-projectile
    :after (projectile flycheck)
    ;:bind (:map flycheck-mode-map
    ;            ("C-c l" . flycheck-projectile-list-errors)
    ;            )
    )
#+end_src


** Snippets

Unlike autocomplete which suggests words / symbols, snippets are pre-prepared templates which you fill in.

Type the shortcut and press =TAB= to complete, or =M-/= to autosuggest a snippet.

#+begin_src emacs-lisp :tangle yes
  (use-package yasnippet
    :delight yas-minor-mode
    :config
    ;(add-to-list 'yas-snippet-dirs "~/.dotfiles/.emacs.files/yasnippet")
    (yas-global-mode t)
    )
#+end_src

Install the default snippets.

#+begin_src emacs-lisp :tangle yes
  (use-package yasnippet-snippets
    :after yasnippet
    )
#+end_src

* TODO Major Modes
** Config Files

Common config file formats.

#+begin_src emacs-lisp :tangle yes
  (use-package ini-mode :defer)
  (use-package ssh-config-mode :defer)
  (use-package nginx-mode :defer)
  (use-package conf-mode :defer
    :mode (("\\.conf\\'"    . conf-space-mode)
           ("\\.setup.*\\'" . conf-space-mode)))
#+end_src

JSON/Yaml.

#+begin_src emacs-lisp :tangle yes
  (use-package json-mode :defer)
  (use-package yaml-mode :defer
    :hook (yaml-mode . display-line-numbers-mode))
#+end_src

** Git

#+begin_src emacs-lisp :tangle yes
  (use-package gitattributes-mode :defer)
  (use-package gitconfig-mode :defer)
  (use-package gitignore-mode :defer)
#+end_src

** Markdown

Markdown support isn't built into Emacs, add it with =markdown-mode=.

#+begin_src emacs-lisp :tangle yes
  (use-package markdown-mode :defer
    :commands (markdown-mode gfm-mode)
    :mode "\\.md\\'")
#+end_src

Use =grip= for live preview in browser.

#+begin_src emacs-lisp :tangle yes
  (use-package grip-mode
    :when window-system
    :ensure-system-package (grip . "pip3 install grip")
    :bind (:map markdown-mode-command-map
           ("g" . grip-mode)))
#+end_src

** Docker

#+begin_src emacs-lisp :tangle yes
  (use-package dockerfile-mode :defer
    :mode "Dockerfile" "\\'Dockerfile."
    :hook (dockerfile-mode . display-line-numbers-mode))
  (use-package docker-compose-mode)
#+end_src

** Plantuml

=PlantUML= is used to create diagrams and graphs.

Automatically downloads the jar the frist time it is used.

#+begin_src emacs-lisp :tangle no
  (use-package plantuml-mode :defer
    :disabled ; Disabled in favor of mermaid-mode.
    :ensure-system-package java
    :custom
    (plantuml-jar-path "~/.emacs.d/plantuml.jar")
    (plantuml-default-exec-mode 'jar)
    :mode ("\\.puml\\'" "\\.uml\\'")
    :config
    (unless (file-exists-p plantuml-jar-path)
      (plantuml-download-jar)))
#+end_src

** Mermaid Diagrams

#+begin_src emacs-lisp :tangle no
  (use-package mermaid-mode
    :mode ("\\.puml\\'" "\\.uml\\'" "\\.mermaid\\'")
    )
#+end_src


** Makefile

Hook =*.mk= to Makefile mode.

#+begin_src emacs-lisp :tangle yes
  (use-package makefile-mode :defer :ensure nil
    :mode "Makefile" "\\.mk\\'"
    :hook (makefile-mode . display-line-numbers-mode))
#+end_src

** Cucumber / Gherkin Feature

Install the major mode to work with feature files.

#+begin_src emacs-lisp :tangle yes
  (use-package feature-mode :defer)
#+end_src

** Protobuf

Install the major mode for protobuf and set the basic code style.

#+begin_src emacs-lisp :tangle yes
  (use-package protobuf-mode
    :hook
    (protobuf-mode . (lambda() (c-add-style "pbstyle" '((c-basic-offset . 2) (indent-tabs-mode . nil)) t)))
    (protobuf-mode . display-line-numbers-mode)
    (protobuf-mode . yas-minor-mode))
#+end_src

** TODO Terraform

TODO: Setup terraform-doc and company-terraform packages.

Enable Terraform major mode with snippet support.

#+begin_src emacs-lisp :tangle yes
  (use-package terraform-mode :defer
    :hook
    (terraform-mode . yas-minor-mode)
    (terraform-mode . terraform-format-on-save-mode)
    )
#+end_src

