.emacs.files/init.el

(use-package flycheck
  :after nvm ; flycheck needs various binaries from npm to setup js/ts linters.
  :ensure-system-package shellcheck
  :custom
  (flycheck-check-syntax-automatically '(save mode-enabled))
  ;; NOTE: Disabled in favor of flycheck-tip.
  ;; :bind
  ;; ("C-c <up>"   . flycheck-next-error)     ; Ctrl-c up   to go to next error.
  ;; ("C-c <down>" . flycheck-previous-error) ; Ctrl-c down to go to previous error.
  :init
  ;; From https://www.flycheck.org/en/28/_downloads/flycheck.html (search for "shellcheck").
  (flycheck-define-checker sh-shellcheck ; Create a custom checker for shellcheck.
    "A shell script syntax and style checker using Shellcheck."
    :command ("shellcheck" "-f" "checkstyle" "-s" (eval (symbol-name sh-shell)) source)
    :modes sh-mode
    :error-parser flycheck-parse-checkstyle)
  :hook
  (sh-mode . flycheck-mode)                                   ; Enable flycheck in sh-mode.
  )

(use-package flycheck-tip
  :after (flycheck hydra)
  :bind
  (:map flycheck-mode-map
        ("C-c <up>"   . hydra-flycheck/flycheck-tip-cycle)         ; Ctrl-c up   to go to next error.
        ("C-c <down>" . hydra-flycheck/flycheck-tip-cycle-reverse) ; Ctrl-c down to go to previous error.
        ("C-c C-n"    . flycheck-tip-cycle)
        ("C-c C-p"    . flycheck-tip-cycle-reverse)
        )
  ("C-c h f" . hydra-flycheck/body)
  :hydra (hydra-flycheck
          (:pre (flycheck-list-errors)
                :post (quit-windows-on "*Flycheck errors*")
                :hint nil)
          "Errors"
          ("f" flycheck-error-list-set-filter "Filter")
          ("j" flycheck-tip-cycle "Next")
          ("k" flycheck-tip-cycle-reverse "Previous")
          ("gg" flycheck-first-error "First")
          ("G" (progn (goto-char (point-max)) (flycheck-previous-error)) "Last")
          ("q" nil))
  )

(use-package flycheck-projectile
  :after (projectile flycheck)
  ;:bind (:map flycheck-mode-map
  ;            ("C-c l" . flycheck-projectile-list-errors)
  ;            )
  )

(use-package yasnippet
  :delight yas-minor-mode
  :config
  ;(add-to-list 'yas-snippet-dirs "~/.dotfiles/.emacs.files/yasnippet")
  (yas-global-mode t)
  )

(use-package yasnippet-snippets
  :after yasnippet
  )

(use-package ini-mode :defer)
(use-package ssh-config-mode :defer)
(use-package nginx-mode :defer)
(use-package conf-mode :defer
  :mode (("\\.conf\\'"    . conf-space-mode)
         ("\\.setup.*\\'" . conf-space-mode)))

(use-package json-mode :defer)
(use-package yaml-mode :defer
  :hook (yaml-mode . display-line-numbers-mode))

(use-package gitattributes-mode :defer)
(use-package gitconfig-mode :defer)
(use-package gitignore-mode :defer)

(use-package markdown-mode :defer
  :commands (markdown-mode gfm-mode)
  :mode "\\.md\\'")

(use-package grip-mode
  :when window-system
  :ensure-system-package (grip . "pip3 install grip")
  :bind (:map markdown-mode-command-map
         ("g" . grip-mode)))

(use-package dockerfile-mode :defer
  :mode "Dockerfile" "\\'Dockerfile."
  :hook (dockerfile-mode . display-line-numbers-mode))
(use-package docker-compose-mode)

(use-package makefile-mode :defer :ensure nil
  :mode "Makefile" "\\.mk\\'"
  :hook (makefile-mode . display-line-numbers-mode))

(use-package feature-mode :defer)

(use-package protobuf-mode
  :hook
  (protobuf-mode . (lambda() (c-add-style "pbstyle" '((c-basic-offset . 2) (indent-tabs-mode . nil)) t)))
  (protobuf-mode . display-line-numbers-mode)
  (protobuf-mode . yas-minor-mode))

(use-package terraform-mode :defer
  :hook
  (terraform-mode . yas-minor-mode)
  (terraform-mode . terraform-format-on-save-mode)
  )

(use-package nvm
  :ensure-system-package
  (
