.emacs.files/init.org
** TODO Javascript / Typescript

Use =nvm= to manage the node version.

#+begin_src emacs-lisp :tangle yes
  (use-package nvm
    :ensure-system-package
    (
     ;; Make sure the required packaes are installed.
     (tsc                        . "npm install --global typescript typescript-plugin-css-modules")
     (typescript-language-server . "npm install --global typescript-language-server")
     (tsserver                   . "npm install --global tide")
     (prettier                   . "npm install --global prettier prettier-plugin-jsdoc")
     (eslint                     . "npm install --global eslint eslint-plugin-jest eslint-plugin-prettier eslint-plugin-jsdoc eslint-formatter-gitlab @babel/core @babel/eslint-parser @babel/plugin-proposal-class-properties")
     ;; Other language servers, to be tested.
     (yaml-language-server       . "npm install --global yaml-language-server")
     (bash-language-server       . "npm install --global bash-language-server")
     (html-languageserver        . "npm install --global vscode-html-languageserver-bin")
     (vscode-json-languageserver . "npm install --global vscode-json-languageserver")

     ;; Not needed by emacs, but might as well put it somewhere as it is quite useful.
     (npm-check-updates . "npm install --global npm-check-updates")
     (yarn              . "npm install --global yarn")
     (jsdoc             . "npm install --global jsdoc jsdoc-mermaid jsdoc-tsimport-plugin tsd-jsdoc tui-jsdoc-template")
     (nodemon           . "npm install --global nodemon")
     (create-react-app  . "npm install --global create-react-app")
     )
    :config
    (nvm-use "14") ; NOTE: The nvm package doesn't support "latest" or "--lts".
    )
#+end_src


TODO: Document this.

#+begin_src emacs-lisp :tangle yes
  (use-package tide
    :after (nvm web-mode typescript-mode company flycheck prettier)
    :bind
    (:map tide-mode-map
          ;; ("<backtab>"      . company-tide)
          ([C-down-mouse-1] . mouse-drag-region)
          ([C-mouse-1]      . tide-jump-to-definition)
          ("<f1>"           . tide-documentation-at-point)
          ("C-c e"          . tide-rename-symbol)
          ("C-c o"          . tide-organize-imports)
          ([remap xref-find-definitions] . tide-jump-to-definition)
          ([remap xref-find-references]  . tide-references)
          )
    :config
    (flycheck-add-next-checker 'tsx-tide 'javascript-eslint 'append)
    (flycheck-add-next-checker 'jsx-tide 'javascript-eslint 'append)
    :custom
    (tide-completion-detailed t)
    (tide-project-cleanup-delay 3600)
    :hook
    (web-mode    . tide-setup)                ; Start with web-mode.
    ;; (tide-mode   . git-gutter-mode)           ; Git info in the maring.
    ;; (tide-mode   . npm-mode)                  ; Set the npm mode to easily run scripts from package.json.
    (tide-mode   . flycheck-mode)             ; Enable flycheck.
    ;; (tide-mode   . display-line-numbers-mode) ; Show line numbers.
    (before-save . tide-format-before-save)   ; NOTE: tide-format-before-save checks that we are in tide-mode, so it is safe to hook to the global 'before-save.
    ;; (tide-mode   . lsp-deferred)           ; Start LSP.
    )

  (use-package js2-mode
    ;; :mode "\\.js$"
    :custom
    (js2-global-externs (list "window" "module" "require" "buster" "sinon" "assert" "refute" "setTimeout" "clearTimeout" "setInterval" "clearInterval" "location" "__dirname" "console" "JSON" "jQuery" "$"))
    ;; :hook
    ;; (js2-mode . setup-tide-mode)
    )

  (use-package typescript-mode
    :after nvm
    ;; :mode "\\.ts$"
    ;; :hook
    ;; (typescript-mode . setup-tide-mode)
    )


  (use-package web-mode
    :after flycheck
    :mode "\\.js$" "\\.jsx$" "\\.ts$" "\\.tsx$"
    :bind
    (:map web-mode-map
          ("C-c C-l" . display-line-numbers-mode)
          ([mouse-2] . web-mode-fold-or-unfold)
          )
    :custom
    ;; TODO: Document this.
    (web-mode-markup-indent-offset 2)
    (web-mode-css-indent-offset 2)
    (web-mode-code-indent-offset 2)
    (web-mode-comment-style 2)

    ;; (web-mode-enable-block-face t)
    ;; (web-mode-enable-comment-keywords t)
    ;; (web-mode-enable-heredoc-fontification t)

    ;; Register the file extension we want to use with web-mode. (web-mode specific, does not overlap with :mode keyword).
    (web-mode-content-types-alist '(("jsx" . "\\.js[x]?\\'") ("tsx" . "\\.ts[x]?\\'")))

    (web-mode-enable-auto-closing t)
    (web-mode-enable-auto-pairing t)

    ;; Enable symbol highlight.
    ;; (web-mode-enable-current-element-highlight t)
    ;; (web-mode-enable-current-column-highlight t) ;; Conflicts with origami. See if lsp-fold helps.
    :config
    (flycheck-add-mode 'typescript-tslint 'web-mode)
    (flycheck-add-mode 'javascript-eslint 'web-mode)
    :hook
    ;; (web-mode . lsp-deferred)
    (web-mode . tide-setup)
    ;; (web-mode . git-gutter-mode)           ; Git info in the maring.
    ;; (web-mode . npm-mode)                  ; Set the npm mode to easily run scripts from package.json.
    ;; (web-mode . display-line-numbers-mode) ; Show line numbers.
    (before-save . (lambda ()
                     (when (eq major-mode 'web-mode)
                       ;; (lsp-format-buffer)
                       ;; (lsp-organize-imports)
                       )
                     )
                 )
    )

  (use-package prettier :delight
    :after nvm
    :config
    (global-prettier-mode t)
    )
#+end_src

