.emacs.files/init.org
** TODO Golang

Go setup.

#+begin_src emacs-lisp :tangle yes
  (use-package go-mode
    :ensure-system-package
    (gopls . "cd /tmp && GO111MODULE=on go get golang.org/x/tools/gopls@latest")

    :preface
    ;; Compilation helper funcs.
    (defun go-save-and-compile-program()
      "Save any unsaved buffers and compile."
      (interactive)
      (save-some-buffers t)
      (compile "sh -c 'go build -o /tmp/a.out && /tmp/a.out'")
      )
    (defun go-save-and-go-generate()
      (interactive)
      (save-some-buffers t)
      (compile "go generate")
      )
    (defun go-save-and-wire()
      (interactive)
      (save-some-buffers t)
      (compile "wire")
      )
    (defun go-save-and-vendor()
      (interactive)
      (save-some-buffers t)
      (compile "sh -c 'go mod tidy && go mod vendor'")
      )
    (defun go-save-and-test-program()
      "Save any unsaved buffers and compile."
      (interactive)
      (save-some-buffers t)
      (compile "go test -v -failfast -cover -coverprofile=/tmp/coverprofile -covermode=count")
      )

    :bind
    (:map go-mode-map
      ([mouse-8] . xref-pop-marker-stack)
      ([mouse-9] . godef-jump)
      ("C-c f"   . go-save-and-compile-program)
      ("C-c g"   . go-save-and-go-generate)
      ("C-c w"   . go-save-and-wire)
      ("C-c i"   . gofmt)
      ("C-c t"   . go-save-and-test-program)
      ("C-c c"   . (lambda() (interactive) (go-coverage "/tmp/coverprofile")))
      ([remap godef-describe]          . lsp-describe-thing-at-point)
      ([remap godef-jump]              . lsp-ui-peek-find-implementation)
      ([remap godef-jump-other-window] . go-guru-definition-other-window)
      ([remap go-rename]               . lsp-rename)
      )

    :config
    (use-package go-guru) ;; Enable =guru= support.
    :config
    (setq
      gofmt-command           "goimports"            ;; Use goimprots instead of gofmt.
      gofmt-args              (quote ("-local=bitbucket.org/mlcloud,github.magicleap.com"))
      gofmt-show-errors       nil                    ;; Don't show errors. Use LSP instead.
      lsp-clients-go-library-directories (quote ("~/go/pkg/mod" ;; Ignore stdlib, go mod cache and go path from LSP.
                                                  "~/goroot"
                                                  "~/go"
                                                  "~/go/src/google.golang.org"
                                                  "~/go/src/golang.org"
                                                  "~/go/src/gopkg.in"
                                                  ))
      )

    :hook
    (go-mode     . lsp)                          ;; Load LSP.
    (go-mode     . yas-minor-mode)               ;; Enable yas.
    (before-save . (lambda()             ;; Format the code with LSP before save.
                     (when (eq major-mode 'go-mode)
                       (lsp-format-buffer)
                       (lsp-organize-imports))))         ;; Let LSP handle imports.
    )
#+end_src

* TODO Org

I should comment on these more...

#+begin_src emacs-lisp :tangle yes
  (setq org-startup-indented 'f)
  (setq org-directory "~/org")
  (setq org-special-ctrl-a/e 't)
  (setq org-default-notes-file (concat org-directory "/notes.org"))
  ;; (define-key global-map "\C-cc" 'org-capture)
  (setq org-src-fontify-natively 't)
  (setq org-src-tab-acts-natively t)
  (setq org-src-window-setup 'current-window)
#+end_src


#+begin_src emacs-lisp :tangle yes
  (use-package org)
   ; :ensure org-plus-contrib)
  (use-package ox-hugo
    :after ox)
#+end_src

Customize appearance.

#+begin_src emacs-lisp :tangle no
  (let*
      ((base-font-color     (face-foreground 'default nil 'default))
       (headline           `(:foreground ,base-font-color)))

    (custom-theme-set-faces 'user
                            `(org-level-8 ((t (,@headline))))
                            `(org-level-7 ((t (,@headline))))
                            `(org-level-6 ((t (,@headline))))
                            `(org-level-5 ((t (,@headline))))
                            `(org-level-4 ((t (,@headline))))
                            `(org-level-3 ((t (,@headline :height 1.3))))
                            `(org-level-2 ((t (,@headline :height 1.3))))
                            `(org-level-1 ((t (,@headline :height 1.3 ))))
                            `(org-document-title ((t (,@headline :height 1))))))
#+end_src

#+begin_src emacs-lisp :tangle no
 (use-package ob-elvish)
 (use-package ob-cfengine3)
 (use-package diminish)
 (use-package org
    :ensure org-plus-contrib
    :bind
    (:map org-mode-map
          ("C-c l" . org-store-link)
          ("A-h" . org-mark-element)
          ("C-a" . org-beginning-of-line)
          ("C-e" . org-end-of-line)
          ("C-k" . org-kill-line))
    :custom
      (org-directory "~/org")
      (org-log-done t)
      (org-startup-indented t)
      (org-log-into-drawer t)
      (org-special-ctrl-a/e t)
      (org-special-ctrl-k t)
      (org-use-speed-commands
       (lambda ()
         (and (looking-at org-outline-regexp)
              (looking-back "^\**"))))
      (org-confirm-babel-evaluate nil)
      (org-src-fontify-natively t)
      (org-src-tab-acts-natively t)
      (org-hide-emphasis-markers t)
      (org-fontify-done-headline t)
      (org-tags-column 0)
      (org-todo-keyword-faces
       '(("AREA"         . "DarkOrchid1")
         ("[AREA]"       . "DarkOrchid1")
         ("PROJECT"      . "DarkOrchid1")
         ("[PROJECT]"    . "DarkOrchid1")
         ("INBOX"        . "cyan")
         ("[INBOX]"      . "cyan")
         ("PROPOSAL"     . "orange")
         ("[PROPOSAL]"   . "orange")
         ("DRAFT"        . "yellow3")
         ("[DRAFT]"      . "yellow3")
         ("INPROGRESS"   . "yellow4")
         ("[INPROGRESS]" . "yellow4")
         ("MEETING"      . "purple")
         ("[MEETING]"    . "purple")
         ("CANCELED"     . "blue")
         ("[CANCELED]"   . "blue")))
      (prettify-symbols-unprettify-at-point 'right-edge)
    :custom-face
      (variable-pitch ((t (:family "ETBembo" :height 180 :weight thin))))
      ;;(variable-pitch ((t (:family "Avenir Next" :height 160 :weight light))))
      (fixed-pitch ((t (:family "Inconsolata Nerd Font"))))
      (org-indent ((t (:inherit (org-hide fixed-pitch)))))
      (org-done ((t (:foreground "PaleGreen"
                                 :strike-through t))))
    :hook
      (org-mode . (lambda () (add-hook 'after-save-hook 'org-babel-tangle :append :local)))
      (org-babel-after-execute . org-redisplay-inline-images)
      (org-mode . visual-line-mode)
      (org-mode . variable-pitch-mode)
      (org-mode . (lambda ()
                    "Beautify Org Checkbox Symbol"
                    (push '("[ ]" . "☐" ) prettify-symbols-alist)
                    (push '("[X]" . "☑" ) prettify-symbols-alist)
                    (push '("[-]" . "⊡" ) prettify-symbols-alist)
                    (prettify-symbols-mode)))
    :config
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((cfengine3 . t)
         (ruby      . t)
         (latex     . t)
         (plantuml  . t)
         (python    . t)
         (shell     . t)
         (elvish    . t)
         (calc      . t)
         (dot       . t)
         (ditaa     . t)
         (org       . t)))
      (font-lock-add-keywords
       'org-mode
       '(("^ *\\([-]\\) "
          (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
      (let* ((variable-tuple
              (cond ((x-list-fonts   "ETBembo")         '(:font   "ETBembo"))
                    ((x-list-fonts   "Source Sans Pro") '(:font   "Source Sans Pro"))
                    ((x-list-fonts   "Lucida Grande")   '(:font   "Lucida Grande"))
                    ((x-list-fonts   "Verdana")         '(:font   "Verdana"))
                    ((x-family-fonts "Sans Serif")      '(:family "Sans Serif"))
                    (nil (warn "Cannot find a Sans Serif Font."))))
             (base-font-color (face-foreground 'default nil 'default))
             (headline `(:inherit default :weight bold
                                  :foreground ,base-font-color)))

        (custom-theme-set-faces
         'user
         `(org-level-8        ((t (,@headline ,@variable-tuple))))
         `(org-level-7        ((t (,@headline ,@variable-tuple))))
         `(org-level-6        ((t (,@headline ,@variable-tuple))))
         `(org-level-5        ((t (,@headline ,@variable-tuple))))
         `(org-level-4        ((t (,@headline ,@variable-tuple :height 1.1))))
         `(org-level-3        ((t (,@headline ,@variable-tuple :height 1.25))))
         `(org-level-2        ((t (,@headline ,@variable-tuple :height 1.5))))
         `(org-level-1        ((t (,@headline ,@variable-tuple :height 1.75))))
         `(org-headline-done  ((t (,@headline ,@variable-tuple :strike-through t))))
         `(org-document-title ((t (,@headline ,@variable-tuple
                                              :height 2.0 :underline nil))))))
      (eval-after-load 'face-remap '(diminish 'buffer-face-mode))
      (eval-after-load 'simple '(diminish 'visual-line-mode))
      (defface org-checkbox-done-text
        '((t (:foreground "#71696A" :strike-through t)))
        "Face for the text part of a checked org-mode checkbox.")

      (font-lock-add-keywords
       'org-mode
       `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?:X\\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)"
          1 'org-checkbox-done-text prepend))
       'append))

  (use-package org-indent
    :ensure nil
    :diminish
    :custom
    (org-indent-indentation-per-level 4))
#+end_src

** Exporters

*** Markdown

Export to Github Flavored Markdown.

#+begin_src emacs-lisp :tangle yes
  (use-package ox-gfm)
#+end_src

* TODO Extra
** TODO Record key frequency

TODO: Auto enable.

Keep track of what gets used so we can drop unused features.

#+begin_src emacs-lisp :tangle yes
  (use-package keyfreq
    ;; NOTE: The default file used to store the stats is ~/.emacs.keyfreq, which is good to be outside ~/.emacs.d as we want to keep it.
    :config
    (keyfreq-mode t)
    (keyfreq-autosave-mode t)
    :custom
    ;; Define the commands to exclude.
    (keyfreq-excluded-commands '(self-insert-command
                                 forward-char
                                 backward-char
                                 previous-line
                                 next-line))
    )
#+end_src

** SSH Agent

From https://github.com/nhoffman/.emacs.d/blob/master/init.org

Set the ssh-agent to the most recent socket in  =/tmp/ssh-*=.

#+begin_src emacs-lisp :tangle yes
  (defun my/ssh-refresh ()
    "Reset the environment variable SSH_AUTH_SOCK"
    (interactive)
    ;(let (ssh-auth-sock-old (getenv "SSH_AUTH_SOCK"))
    (setenv "SSH_AUTH_SOCK"
            (car (split-string
                  (shell-command-to-string
                   "ls -t $(find /tmp/ssh-* -group $USER -name 'agent.*' 2> /dev/null) | head -1"))))
      ;;   (message
      ;;    (format "SSH_AUTH_SOCK %s --> %s"
      ;;            ssh-auth-sock-old (getenv "SSH_AUTH_SOCK"))))
      )
#+end_src

Reload ssh agent now and env every 10 minutes.

#+begin_src emacs-lisp :tangle yes
(run-with-timer 0 (* 60 10) 'my/ssh-refresh)
#+end_src

** TODO Emacs server

#+begin_src emacs-lisp :tangle no
(add-hook 'after-make-frame-functions
          (lambda (frame)
            (select-frame frame)
            (my/setup-color-theme)))
#+end_src
